app/controllers/webhooks_controller.rb

  def index
    @webhooks = Webhook.all
---
SELECT "webhooks".* FROM "webhooks"

  def create
    @webhook = Webhook.new(webhook_params)
    @webhook.source = params[:source]
    @webhook.data = params
    # @webhook.data = params.except(:controller, :action)
      if @webhook.save
---
INSERT INTO "webhooks" ("source", "data", "message", "event", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"